package simplerpc;

/**
 * 本类定义协议常量。
 *
 * Frame结构
 * -----------------------------------------------------------------------------
 * |  frame长度4字节  |  frame类型1字节 |  指令代码2字节  |  请求序号4字节  |  Body  |
 * -----------------------------------------------------------------------------
 *
 * Frame长度的4个字节不包含自己；frame类型为请求和响应；由TYPE_REQ/TYPE_RESP定义；指令代码业务应该使用1000以上的，以下系统保留。
 *
 * frame类型目前用了最低的2bit，上面6个bit保留，高位的6个bit如果不支持，应该忽略。
 *
 * 请求Body结构自定义，响应Body结构为
 * ----------------------------
 * |  响应码2字节  |  响应内容  |
 * ----------------------------
 *
 * 如果响应码为成功，后面是自定义响应内容，如果为失败，后面是一个错误消息字符串。字符串使用4个字节标明长度，UTF8编码。
 *
 * @author huangli
 */
public interface Commands {
    byte[] HAND_SHAKE_BYTES = new byte[] {
            -64, 2, -98, 0, -89, -8, 40, 111, 80, -61, 78, 59, 26, -104, -38, 29, 104, -100, 66, -78, -94, 3, 40, -33,
            -101, 52, 90, 60, 109, 53, 77, -12
    };

    short COMMAND_PING = 1;
    short COMMAND_CLOSE = 2;

    short CODE_SUCCESS = 1;
    short CODE_FAIL = 2;

    // 1个字节表示请求还是响应，2个字节表示指令类型，4个字节表示请求响应的序号
    int HEAD_LENGTH = 7;

    // 这个地方以后改成0和1比较好，省一个bit
    byte TYPE_REQ = 1;
    byte TYPE_RESP = 2;

    int TYPE_MASK = 3;
}
